tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "act"
brew "bat"
brew "btop"
brew "coreutils"
brew "duti"
brew "entr"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fuc"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-gui"
brew "glow"
brew "gnupg"
brew "hyperfine"
brew "icu4c@76"
brew "ifstat"
brew "imagemagick"
brew "iperf3"
brew "k6"
brew "mas"
brew "mask"
brew "mise"
brew "mprocs"
brew "mtr"
brew "pandoc"
brew "podman"
brew "prettyping"
brew "ripgrep-all"
brew "scrcpy"
brew "starship"
brew "tig"
brew "trivy"
brew "watch"
brew "yazi"
brew "yq"
brew "zoxide"
cask "affinity"
cask "aldente"
cask "android-platform-tools"
cask "beekeeper-studio"
cask "blender"
cask "bruno"
cask "claude-code"
cask "claudebar"
cask "cyberduck"
cask "darkmodebuddy"
cask "figma"
cask "font-atkinson-hyperlegible"
cask "font-young-serif"
cask "gimp"
cask "gram"
cask "helium-browser"
cask "iterm2"
cask "keepingyouawake"
cask "lens"
cask "linearmouse"
cask "little-snitch"
cask "maccy"
cask "obs"
cask "obsidian"
cask "orbstack"
cask "rectangle"
cask "resilio-sync"
cask "slack"
cask "spotify"
cask "swiftbar"
cask "trex"
cask "viscosity"
cask "visual-studio-code"
cask "zen"
mas "Bitwarden", id: 1352778147
mas "DaVinci Resolve", id: 571213070
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Meeting Owl", id: 1219076447
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Userscripts", id: 1463298887
mas "Xcode", id: 497799835
vscode "aquasecurityofficial.trivy-vulnerability-scanner"
vscode "astro-build.astro-vscode"
vscode "beerush.svem"
vscode "bierner.emojisense"
vscode "bradlc.vscode-tailwindcss"
vscode "brunnerh.insert-unicode"
vscode "chanzhaoyu.svelte-5-snippets"
vscode "deepinthought.vscode-shell-snippets"
vscode "denoland.vscode-deno"
vscode "dprint.dprint"
vscode "editorconfig.editorconfig"
vscode "fill-labs.dependi"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "hansu.git-graph-2"
vscode "heybourn.headwind"
vscode "kortina.vscode-markdown-notes"
vscode "letmaik.git-tree-compare"
vscode "lokalise.i18n-ally"
vscode "maattdd.gitless"
vscode "mechatroner.rainbow-csv"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-containers"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "naumovs.color-highlight"
vscode "ow.vscode-subword-navigation"
vscode "redhat.vscode-yaml"
vscode "richardluo.inline-parameters"
vscode "rust-lang.rust-analyzer"
vscode "sanjulaganepola.github-local-actions"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "tomoki1207.pdf"
vscode "typescriptteam.native-preview"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vivaxy.vscode-conventional-commits"
vscode "vue.volar"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
