tap "homebrew/bundle"
tap "homebrew/core"
tap "oven-sh/bun"
tap "satrik/togglemute"
tap "teamookla/speedtest"
brew "act"
brew "bat"
brew "btop"
brew "coreutils"
brew "deno"
brew "entr"
brew "eza"
brew "fd"
brew "fuc"
brew "fzf"
brew "gh"
brew "git"
brew "git-gui"
brew "glow"
brew "go"
brew "hyperfine"
brew "icu4c@76"
brew "ifstat"
brew "imagemagick"
brew "iperf3"
brew "mas"
brew "mask"
brew "mprocs"
brew "mtr"
brew "node"
brew "prettier"
brew "prettyping"
brew "python@3.13"
brew "ripgrep-all"
brew "starship"
brew "uv"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zx"
brew "oven-sh/bun/bun"
brew "teamookla/speedtest/speedtest"
cask "beekeeper-studio"
cask "breitbandmessung"
cask "bruno"
cask "diffusionbee"
cask "figma"
cask "firefox-developer-edition"
cask "font-atkinson-hyperlegible"
cask "font-young-serif"
cask "gimp"
cask "google-chrome"
cask "iterm2"
cask "keepingyouawake"
cask "lens"
cask "linearmouse"
cask "logseq"
cask "maccy"
cask "obs"
cask "obsidian"
cask "orbstack"
cask "rectangle"
cask "senadevicemanager"
cask "slack"
cask "spotify"
cask "swiftbar"
cask "togglemute"
cask "trex"
cask "viscosity"
cask "visual-studio-code"
cask "zen"
mas "Bitwarden", id: 1352778147
mas "DaVinci Resolve", id: 571213070
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Meeting Owl", id: 1219076447
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Userscripts", id: 1463298887
mas "Xcode", id: 497799835
vscode "angular.ng-template"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "brunnerh.insert-unicode"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "evondev.dracula-high-contrast"
vscode "foxundermoon.shell-format"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "heybourn.headwind"
vscode "lokalise.i18n-ally"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.symbols"
vscode "mkhl.shfmt"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "naumovs.color-highlight"
vscode "ow.vscode-subword-navigation"
vscode "pflannery.vscode-versionlens"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "richardluo.inline-parameters"
vscode "sanjulaganepola.github-local-actions"
vscode "shardulm94.trailing-spaces"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zengxingxin.sort-js-object-keys"
