tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "oven-sh/bun"
tap "satrik/togglemute"
tap "teamookla/speedtest"
brew "act"
brew "bat"
brew "btop"
brew "node"
brew "corepack"
brew "coreutils"
brew "ctop"
brew "deno"
brew "entr"
brew "eza"
brew "fd"
brew "fuc"
brew "fzf"
brew "gh"
brew "git"
brew "git-gui"
brew "glow"
brew "go"
brew "hyperfine"
brew "icu4c@76"
brew "ifstat"
brew "imagemagick"
brew "iperf3"
brew "mas"
brew "mask"
brew "mprocs"
brew "mtr"
brew "podman"
brew "prettier"
brew "prettyping"
brew "python@3.13"
brew "ripgrep-all"
brew "starship"
brew "tmux"
brew "uv"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zx"
brew "oven-sh/bun/bun"
brew "teamookla/speedtest/speedtest"
cask "beekeeper-studio"
cask "blender"
cask "bruno"
cask "cyberduck"
cask "diffusionbee"
cask "figma"
cask "font-atkinson-hyperlegible"
cask "font-young-serif"
cask "gimp"
cask "google-chrome"
cask "iterm2"
cask "keepingyouawake"
cask "lens"
cask "linearmouse"
cask "maccy"
cask "obs"
cask "obsidian"
cask "orbstack"
cask "rectangle"
cask "resilio-sync"
cask "senadevicemanager"
cask "slack"
cask "spotify"
cask "swiftbar"
cask "togglemute"
cask "trex"
cask "viscosity"
cask "visual-studio-code"
cask "zed"
cask "zen"
mas "Bitwarden", id: 1352778147
mas "DaVinci Resolve", id: 571213070
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Meeting Owl", id: 1219076447
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Userscripts", id: 1463298887
mas "Xcode", id: 497799835
vscode "akiravoid.format-with-cli"
vscode "astro-build.astro-vscode"
vscode "beerush.svem"
vscode "bradlc.vscode-tailwindcss"
vscode "brunnerh.insert-unicode"
vscode "chanzhaoyu.svelte-5-snippets"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "evondev.dracula-high-contrast"
vscode "fill-labs.dependi"
vscode "foxundermoon.shell-format"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "heybourn.headwind"
vscode "kortina.vscode-markdown-notes"
vscode "lokalise.i18n-ally"
vscode "maattdd.gitless"
vscode "mechatroner.rainbow-csv"
vscode "mkhl.shfmt"
vscode "ms-azuretools.vscode-containers"
vscode "naumovs.color-highlight"
vscode "ow.vscode-subword-navigation"
vscode "richardluo.inline-parameters"
vscode "sanjulaganepola.github-local-actions"
vscode "shardulm94.trailing-spaces"
vscode "shiftgeist.dracula-high-contrast-lightness"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "typescriptteam.native-preview"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vue.volar"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zengxingxin.sort-js-object-keys"
go "github.com/air-verse/air"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/gravityblast/fresh"
go "github.com/actgardner/gogen-avro/v9/cmd/gogen-avro"
go "github.com/fatih/gomodifytags"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "mvdan.cc/sh/v3/cmd/shfmt"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/emad-elsaid/xlog/cmd/xlog"
