# ---
# Install 'brew bundle install'
# Match your current system configuration to your brewfile 'brew bundle --force cleanup'
# ---

# 'brew tap'
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask"

# 'brew install'
brew "bat"
brew "docker-compose"
brew "docker"
brew "eza"
brew "fzf"
brew "gh"
brew "gifski"
brew "git"
brew "go"
brew "imagemagick"
brew "jq"
brew "mas"
brew "node"
brew "python@3"
brew "watchman"
brew "webp"

# 'brew install --cask'
cask "alt-tab" # Enable Windows-like alt-tab
cask "beekeeper-studio" # Cross platform SQL editor and database management app
cask "figma" # Collaborative team software
cask "firefox" # Web browser
cask "font-atkinson-hyperlegible" # Font with greater legibility and readability for low vision readers (Sans)
# cask "font-dm-mono" # ❔ (Serif)
# cask "font-roboto-mono-nerd-font" # ❔ (Alternative Mono)
cask "font-young-serif" # Heavy weight old style serif typeface (Serif)
cask "insomnia" # HTTP and GraphQL Client
cask "iterm2" # Terminal emulator as alternative to Apple's Terminal app
# cask "linear-linear" # ❔ App to manage software development and track bugs
cask "meetingbar" # Shows the next meeting in the menu bar
cask "rectangle" # Move and resize windows using keyboard shortcuts or snap areas
cask "slack" # Team communication and collaboration software
cask "spotify" # Music streaming service
# cask "stats" # ❔ System monitor for the menu bar
cask "visual-studio-code" # Open-source code editor

# 'mas install'
# mas "1Password", id: 443987910

# 'whalebrew install'
# whalebrew "whalebrew/wget"

# 'vscode --install-extension'
vscode "bierner.markdown-footnotes"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "editorconfig.editorconfig"
vscode "gruntfuggly.todo-tree"
vscode "kshetline.ligatures-limited"
vscode "maattdd.gitless"
vscode "ms-azuretools.vscode-docker"
vscode "naumovs.color-highlight"
vscode "ow.vscode-subword-navigation"
vscode "simonsiefke.prettier-vscode"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.todo-md"
vscode "yzhang.markdown-all-in-one"
vscode "zengxingxin.sort-js-object-keys"
